export default function Introduction() {
  return (
    <section>
      <p className="text-gray-700">
        저는 채용 플렛폼 스타트업과 농업 스타트업 등 에서 경력을 쌓아온 프론트
        엔드 개발자입니다. <br />
        <br />
        농업 스타트업 팀에선 여러 명의 팀원과 함께 협업하는 방법 위주로 배워왔고
        경험을 쌓았습니다.
        <br />
        <br />
        최근 까지는 채용 플렛폼 팀에선 1인 프론트엔드 개발자로서 프로젝트 전반을
        설계하고 구현하며, TypeScript, Next.js, React Query, Recoil, Tailwind,
        SCSS 등을 활용해 안정적이면서도 확장 가능한 서비스를 만들어왔습니다.
        <br />
        <br />
        마케터와 일 단위 데이터 변화를 함께 살펴보며 퍼널 개선을 논의했고,
        PO/PD와의 기획 과정에서는 요구사항을 검토하며 개선점을 제안하며 제품의
        완성도를 높였습니다. 또한 Figma를 활용한 디자인 시스템 구축에도 참여해,
        디자이너와 효율적으로 소통하며 일관된 UI/UX를 구현했습니다. 커리어
        초기부터 두 번째 회사까지 PHP, Node.js를 사용한 백엔드 개발과 MySQL/AWS
        기반 인프라 구축, DB 설계, API 구현을 담당했던 경험을 바탕으로,
        커피챗에서는 백엔드 개발자와 API 구조 설계에도 적극 참여하며 데이터와
        인터페이스를 함께 고민했습니다.
        <br />
        <br />
        앱 내 웹뷰 기능 개발도 맡아 웹과 앱의 사용자 경험을 연결하는 작업을
        진행했습니다. 배포와 품질 관리는 Vercel, Sentry, Google Analytics,
        Google Search Console 등을 활용해 체계적으로 관리했고, 여러 프로젝트에서
        0 to 1 단계의 서비스 개발을 주도하며 실제로 런칭까지 경험했습니다.
        <br />
        <br />
        최근에는 Cursor 등 AI 기반 개발 도구를 탐구하며 업무 효율과 코드 품질
        향상에도 관심을 두고 적용해보고 있습니다. 앞으로는 0 to 1을 넘어 1 to 2
        단계로 성장하는 서비스를 개발하며, 다양한 개발자와 협업을 통해{" "}
        <b>팀과 함께 더 큰 성장을 만들어가는 경험을 쌓고 싶습니다.</b>
      </p>
    </section>
  );
}
